>>===== MODE =====>>
citation
<<===== MODE =====<<


>>===== DESCRIPTION =====>>
<https://github.com/Juris-M/citeproc-js/issues/202>
<<===== DESCRIPTION =====<<


>>===== RESULT =====>>
2001 in English, 2001 in English, 2001 in English
<<===== RESULT =====<<


>>===== CSL =====>>
<style
      xmlns="http://purl.org/net/xbiblio/csl"
      class="in-text"
      version="1.0">
  <info>
    <id />
    <title />
    <updated>2022-04-24T00:00:00+08:00</updated>
  </info>
  <locale xml:lang="zh">
    <date form="text">
      <date-part name="year" suffix=" in Chinese"/>
    </date>
  </locale>
  <locale>
    <date form="text">
      <date-part name="year" suffix=" in English"/>
    </date>
  </locale>
  <macro name="issued-date">
    <date variable="issued" form="text"/>
  </macro>
  <macro name="citation-layout">
    <text macro="issued-date"/>
  </macro>
  <citation>
    <layout delimiter="; " locale="zh">
      <text macro="citation-layout"/>
    </layout>
    <layout delimiter="; ">
      <group delimiter=", ">
        <date variable="issued" form="text"/>
        <text macro="issued-date"/>
        <text macro="citation-layout"/>
      </group>
    </layout>
  </citation>
</style>
<<===== CSL =====<<


>>===== INPUT =====>>
[
    {
        "id": "ITEM-1",
        "type": "book",
        "issued": {
            "date-parts": [
                [
                    2001
                ]
            ]
        },
        "language": "en"
    }
]
<<===== INPUT =====<<


>>===== VERSION =====>>
1.0
<<===== VERSION =====<<
